[
    {
        "nama_aplikasi": "Philander News",
        "judul": "Membangun Aplikasi Portal Berita Berbasis<br>Web Service Menggunakan Golang dan MongoDB",
        "abstrak": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dalam era digital, akses mudah ke berita dan informasi terkini sangat penting. Untuk memenuhi kebutuhan ini, portal berita berbasis web menjadi sarana utama. Namun, pengembangan aplikasi portal berita berbasis web memerlukan penyelesaian beberapa masalah, seperti membangun basis data lintas platform, membuat backend yang dapat diakses publik, membuat API untuk menghubungkan backend dengan frontend, dan mengintegrasikan frontend dengan API. Dalam pengembangan aplikasi ini, bahasa pemrograman Golang digunakan untuk backend, JavaScript untuk antarmuka HTML, dan MongoDB untuk penyimpanan data. Google Cloud Platform digunakan untuk mengintegrasikan MongoDB dengan frontend. Harapannya tujuan dibuat aplikasi portal berita PhilanderNews ini dapat menyajikan berita dan informasi terpercaya",
        "latar_belakang": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dalam era digital yang semakin maju, akses ke berita dan informasi terkini telah menjadi sangat penting bagi masyarakat modern. Portal berita berbasis web telah menjadi sarana utama untuk menyediakan berita dan informasi yang mudah diakses secara online. Dalam konteks ini, pengembangan portal berita berbasis web menjadi sebuah tugas yang penting untuk memenuhi kebutuhan masyarakat akan berita terkini dan terpercaya. <br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dalam rangka mengembangkan aplikasi layanan web dengan tema portal berita, ada beberapa masalah yang harus diselesaikan, masalah pertama yaitu membangun  basis data  yang lintas platform, selanjutnya membangun package backend yang dapat diakses secara publik, kemudian membuat API yang dapat menghubungkan backend dengan frontend, dan terakhir mengintegrasikan frontend dengan API yang telah dibuat . Berdasarkan hasil kajian yang telah kami lakukan, kami memutuskan untuk menggunakan bahasa pemrograman Golang dalam upaya membangun backend yang  optimal untuk proyek ini. Meskipun Golang mengintegrasikan prinsip-prinsip Bahasa pemrograman lain, namun perlu ditekankan bahwa Golang menonjol dengan kinerja yang terbilang efisien. <br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Dalam mengembangkan aplikasi berbasis web, kami merasa penting untuk menyediakan antarmuka yang mampu menampilkan aplikasi dalam format HTML. Untuk tujuan ini, kami memilih untuk menggunakan bahasa  pemrograman JavaScript. Perlu dicatat bahwa JavaScript memiliki keunggulan signifikan dalam konteks pengembangan aplikasi web dan situs, sebab bahasa ini berjalan di sisi klien, mampu menciptakan interaktivitas yang responsif, mendukung pemrosesan asinkron, serta memanfaatkan ekosistem yang sangat beragam dan fleksibel. <br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dalam konteks pengambilan dan penyimpanan data, kami telah memilih system basis data MongoDB. MongoDB adalah sebuah sistem basis data berorientasi dokumen yang bersifat lintas platform dan dikategorikan sebagai sistem basis data NoSQL. Untuk mengintegrasikan MongoDB dengan frontend, kami memanfaatkan layanan yang disediakan oleh Google Cloud Platform (GCP). Google Cloud Platform adalah suatu rangkaian layanan komputasi, penyimpanan data, dan pengembangan aplikasi di ranah komputasi awan yang awalnya dikembangkan oleh Google.",
        "indentifikasi_masalah": "Berdasarkan latar belakang di atas dapat di identifikasi masalah pada proyek kali ini ialah sebagai berikut :<br><br>1. Bagaimana membuat aplikasi portal berita sederhana yang dapat menyajikan berita terpercaya?<br>2. Bagaimana membuat aplikasi menggunakan framework?<br>3. Bagaimana membuat aplikasi yang terhubungn dengan API?",
        "tujuan": "Berdasarkan masalah yang telah di indetifikasi pada proyek kali ini dapat di uraikan tujuan dari proyek kali ini ialah sebagai berikut :<br><br>1. Membuat aplikasi portal berita sederhana yang dapat menyajikan berita terpercaya.<br>2. Membuat aplikasi menggunakan framework.<br>3. Membuat aplikasi yang terhubung dengan API.",
        "lingkup_dokumentasi": "1. Bahasa pemrograman yang digunakan adalah Golang.<br>2. Framework yang digunakan adalah Bulma.<br>3. Database yang digunakan adalah MongoDB.",
        "jadwal_pelaksanaan": "images/JadwalPelaksanaan.jpg",
        "anggota_tim": "1. Ibrohim Mubarok (Backend)<br>2. Fitrah Ali Akbar Setiawan (Frontend)"
    }
]